In [1]:
# Dependencies and Setup
import pandas as pd
from pathlib import Path

# File to Load (Remember to Change These)
school_data_to_load = Path("Resources/schools_complete.csv")
student_data_to_load = Path("Resources/students_complete.csv")

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [2]:
print('District Summary')

District Summary

In [3]:
# Calculate the total number of students
student_count = len(student_data)
student_count

39170

In [4]:
# Calculate the total budget
total_budget = school_data['budget'].sum()
total_budget

24649428

In [5]:
# Calculate the average (mean) math score
average_math_score = student_data['math_score'].mean()
average_math_score

78.98537145774827

In [6]:
# Calculate the average (mean) reading score
average_reading_score = student_data['reading_score'].mean()
average_reading_score

81.87784018381414

In [7]:
# Use the following to calculate the percentage of students who passed math (math scores greather than or equal to 70)
passing_math_count = school_data_complete[(school_data_complete["math_score"] >= 70)].count()["student_name"]
passing_math_percentage = passing_math_count / float(student_count) * 100
passing_math_percentage

74.9808526933878

In [10]:
# Calculate the percentage of students who passed reading (hint: look at how the math percentage was calculated)  
passing_reading_count = school_data_complete[(school_data_complete["reading_score"] >= 70)].count()["student_name"]
passing_reading_percentage = passing_reading_count / float(student_count) * 100
passing_reading_percentage

85.80546336482001

In [11]:
# Use the following to calculate the percentage of students that passed math and reading
passing_math_reading_count = school_data_complete[
    (school_data_complete["math_score"] >= 70) & (school_data_complete["reading_score"] >= 70)
].count()["student_name"]
overall_passing_rate = passing_math_reading_count /  float(student_count) * 100
overall_passing_rate

65.17232575950983

In [24]:
# Create a high-level snapshot of the district's key metrics in a DataFrame
district_summary =pd.DataFrame ({'Total Schools':[len(school_data['School ID'])],
                    'Total Students':[student_count],
                    'Total Budget':[total_budget],
                    'Average Math Score':[average_math_score],
                    'Average Reading Score':[average_reading_score],
                    '% Passing Math': [passing_math_percentage],
                    '% Passing Reading':[passing_reading_percentage],
                    '% Overall Passing':[overall_passing_rate]
                    })

# Formatting
district_summary["Total Students"] = district_summary["Total Students"].map("{:,}".format)
district_summary["Total Budget"] = district_summary["Total Budget"].map("${:,.2f}".format)

# Display the DataFrame
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

In [25]:
print('School Summary')

School Summary

In [31]:
# Use the code provided to select all of the school types
school_types = school_data['type'].unique()
school_types

array(['District', 'Charter'], dtype=object)

In [124]:
# Calculate the total student count per school
per_school_counts =pd.DataFrame({'school name':'school_name','total students':school_data_complete.groupby(['School ID'])['Student ID'].count()})
per_school_counts

           school name  total students
School ID
0          school_name            2917
1          school_name            2949
2          school_name            1761
3          school_name            4635
4          school_name            1468
5          school_name            2283
6          school_name            1858
7          school_name            4976
8          school_name             427
9          school_name             962
10         school_name            1800
11         school_name            3999
12         school_name            4761
13         school_name            2739
14         school_name            1635

In [118]:
# Calculate the total school budget and per capita spending per school

per_school_budget = pd.DataFrame({'name school': school_data['school_name'],'total budget':school_data_complete.groupby(['School ID'])['budget'].sum()})

per_school_capita = pd.DataFrame({'name school': school_data['school_name'],'per capita spending':school_data_complete.groupby(['School ID'])['budget'].sum()/per_school_counts['total students']})

school_budget_capita = pd.merge(per_school_budget, per_school_capita)
school_budget_capita

              name school  total budget  per capita spending
0       Huang High School    5573322295            1910635.0
1    Figueroa High School    5557128039            1884411.0
2     Shelton High School    1860672600            1056600.0
3   Hernandez High School   14007062700            3022020.0
4     Griffin High School    1346890000             917500.0
5      Wilson High School    3012587442            1319574.0
6     Cabrera High School    2009159448            1081356.0
7      Bailey High School   15549641728            3124928.0
8      Holden High School     105933149             248087.0
9        Pena High School     563595396             585858.0
10     Wright High School    1888920000            1049400.0
11  Rodriguez High School   10186904637            2547363.0
12    Johnson High School   14733628650            3094650.0
13       Ford High School    4831365924            1763916.0
14     Thomas High School    1705517550            1043130.0

In [115]:
# Calculate the average test scores per school
per_school_math = pd.DataFrame({'School ID': school_data['School ID'],'Average test math scores':school_data_complete.groupby(['School ID'])['math_score'].mean()})

per_school_reading = pd.DataFrame({'School ID': school_data['School ID'],'Average test reading scores':school_data_complete.groupby(['School ID'])['reading_score'].mean()})
school_math_reading = pd.merge(per_school_math, per_school_reading)
school_math_reading

    School ID  Average test math scores  Average test reading scores
0           0                 76.629414                    81.182722
1           1                 76.711767                    81.158020
2           2                 83.359455                    83.725724
3           3                 77.289752                    80.934412
4           4                 83.351499                    83.816757
5           5                 83.274201                    83.989488
6           6                 83.061895                    83.975780
7           7                 77.048432                    81.033963
8           8                 83.803279                    83.814988
9           9                 83.839917                    84.044699
10         10                 83.682222                    83.955000
11         11                 76.842711                    80.744686
12         12                 77.072464                    80.966394
13         13                 77.102592                    80.746258
14         14                 83.418349                    83.848930

In [132]:
# Calculate the number of students per school with math scores of 70 or higher
students_passing_math = school_data_complete.loc[school_data_complete['math_score']>70]
school_students_passing_math = pd.DataFrame({'name school': school_data['school_name'],'math scores of 70 or higher':students_passing_math.groupby(['School ID'])['students_passing_math']})
school_students_passing_math

KeyError: 'Column not found: students_passing_math'